<!DOCTYPE html>
<head>
    <meta charset="utf-8">
    <meta property="og:title" content="Css | Интересно о программировании">
	<title>Css | Интересно о программировании</title>
	<?php include "scripts/icons.php";?>
</head>
<body>
    <center>
        <img src="images/logos/css-logo.png">
    <h1>Что такое CSS?</h1>
    <h4>CSS — формальный язык описания внешнего вида документа, написанного с использованием языка разметки. Также может применяться к любым XML-документам, например, к SVG или XUL.Иначе говоря, CSS - внешний вид вашей странички/сайта тоесть <a href="/HTML" target=_blank>HTML</a>-документа.И да,на этой страничке тоже применён CSS но об этом чуть позже.У CSS есть несколько плюсов:Во-первых,он уже установлен на вашем компьютере.Во-вторых, для редактирования Css не нужны текстовые редакторы.Тоесть можно программировать прямо в блокноте.Ну или в простом редакторе типа <a href="https://www.sublimetext.com/" target="_blank">Sublime text</a>.Но если у вас уже устанолен текстовый редактор, то для работы с CSS не нужно скачивать никаких расширений.</h4><hr>
    <h1>От теории к практике</h1>
    <h4>Итак,теперь вы знаете, что такое CSS.Значит можно приступать к практике!Для начала, давайте посмотрим на CSS-код.Он находится там-же,где и HTML.Для этого нажмите правой кнопкой мыши на любой элемент странички,и выберите пункт "Просмотреть код страницы"(ну или что-то вроде этого.В каждом браузере по-разному) и у вас откроется код.Посмотрев видео ниже,можно начинать программировать!</h4>
    <iframe width="860" height="500" src="https://www.youtube.com/embed/iPV5GKeHyV4?start=10" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen ></iframe><hr>
    <h3>CSS также как и HTML можно просмотреть через консоль разработчика через консоль разработчика.</h3>
    <img src="images/img_4.png">
    <h5>Просмотр CSS-кода через браузерный редактор</h5>
    <br>
    <h4>Теперь перейдём к написанию кода.Для этого можно открыть любой текстовый редактор.После того,как вы написали код, сохраните ваш CSS-файл с расширением <u>.css</u>.Чтобы подключить CSS к HTML нужно в html-файле ввести данную команду:</h4>
    <iframe width="342" height="50" src="/examples/css.txt" class="example"></iframe>
    <h4>Но стоит помнить,что данный код следует прописывать между тегами <u>head</u>.</h4>
    </center>
    <?php include 'scripts/menu.php';?>
</body>