<!DOCTYPE html>
<head>
    <meta charset="utf-8">
    <meta property="og:title" content="Html | Интересно о программировании">
	<title>Html | Интересно о программировании</title>
	<?php include "scripts/icons.php";?>
</head>
<body>
    <center>
        <img src="images/logos/html-logo.png">
        <h1>Что такое HTML?</h1>
        <h4>HTML (HyperText Markup Language — «язык гипертекстовой разметки») — самый базовый строительный блок Веба. Он определяет содержание и структуру веб-контента. Другие технологии, помимо HTML, обычно используются для описания внешнего вида/представления (CSS) или функциональности/поведения (JavaScript) веб-страницы.Иначе говоря HTML-это скелет любой веб-страницы.Даже эта страничка, на которой вы сейчас находитесь сделана на HTML.HTML довольно прост в использовании.Чтобы создать свою первую HTML - страничку,нужно только знание тегов(и то не всех).Ещё один плюс HTML заключается в том,что он уже установлен на вашем компьютере.Также для редактирования HTML не обязательно скачивать редактор, ведь можно проограммировать в блокноте(ну или в совсем простом редакторе типа <a href="https://www.sublimetext.com/" target="_blank">Sublime text</a>).Но если у вас уже устанолен текстовый редактор, то для работы с HTML не нужно скачивать никаких расширений.</h4><hr>
        <h1>От теории к практике</h1>
        <h4>Итак,теперь вы знаете, что такое HTML.Значит можно приступать к практике!Для начала, давайте посмотрим на HTML-код.Для этого нажмите правой кнопкой мыши на любой элемент странички,и выберите пункт "Просмотреть код страницы"(ну или что-то вроде этого.В каждом браузере по-разному) и у вас откроется код.Посмотрев видео ниже,можно начинать программировать!</h4>
        <iframe width="860" height="500" src="https://www.youtube.com/embed/bWNmJqgri4Q" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        <h4>Также можно редактировать HTML-код на любой странице.Для этого нажмите правой кномкой на нужный элемент и выберите пункт "Просмотреть код".Далее выберите необходимый элемент,и нажмите "Edit as HTML".Затем вы сможете редактировать HTML.После того,как вы вписали свой код,нажмите на пустое место в браузерном редакторе.Страничка отредактирована!Но после перезагрузки страницы,код вернётся в прежнее положение.</h4>
        <img src="images/img_2.png">
        <h5>HTML-код в браузерном редакторе</h5>
        <br><hr>
        <h1>Создаём свою первую страничку!</h1>
        <h4>Итак,вы уже знаете,что такое HTML и как редактировать странички.Пришло время создать свою первую страничку!Для начала введите текстовый редактор(или блокнот) и введите туда свой код.После этого сохраните свой файл как HTML-файл.Не забывайте,что HTML-файл нужно сохранять с расширением <u>.html</u>!</h4>
        <img src="images/img_3.png">
        <h5>Расширение HTML-файла</h5>
        <h4>Затем откройте файл двойным щелчком.Ваша первая страничка готова!</h4>
    </center>
    <?php include 'scripts/menu.php';?>
</body>