<!DOCTYPE html>
<head>
    <meta charset="utf-8">
    <meta property="og:title" content="Главная | Интересно о программировании">
	<title>Главная | Интересно о программировании</title>
    <?php include "scripts/icons.php";?>
</head>
<body>

	<center>
		<img src="images/head-icon.png">
		<h4>
			Сегодня мы с вами поговорим о программировании.Начнём мы с того, что собой представляет программирование.Программирование-это процесс создания компьютерных программ.На сегодняшний день программирование - довольно востребованная профессия.Но в основном всё зависит от вашего желания и выбора первого языка.Языков программирования на самом деле довольно много(если коротко, то от 1000 до 10 тысяч).Без языков программирования мир в нынешнем виде просто не существовал бы. Представьте, что мы живём без компьютеров, цифровых технологий, всех этих интернетов с YouTube и Вконтакте. Вообразить такое очень сложно, если вообще возможно.
		</h4>
	<img src="images/img_1.jpg">
	<h1>Топ 5 языков программирования</h1>
	<h4>Логично, что нужно учить тот язык,который сейчас популярен.Вот топ 5 языков программирования:</h4>
	</center>
	<h4>
		<ol>
			<li>Python:
			Это пожалуй самый актуальный язык программирования на сегодняшний день, на нём вы сможете программировать почти всё что угодно, от обычных программ, до нейросетей.</li>
			<li>JavaScript:
			Этот язык очень востребован, на момент 31 января 2021 года, на сайте HeadHunter, по Москве около 2900 вакансий, что очень много.</li>
			<li>Java:
			Этот язык очень долгое время был номер один по популярности язык программирования, также его большим плюсом будет его кроссплатформенность, но его минус, на мой взгляд, это не очень красивый код и вообще он достаточно сложный.</li>
			<li>С#:
			Достаточно популярный язык программирования и подойдёт тем, кто хочет работать с Windows, да вообще с продуктами от Microsoft, также подойдёт тем, кто хочет разрабатывать компьютерные игры, если вы его изучите, то сможете разрабатывать игры на движке Unity 3D.</li>
			<li>PHP:
			Тоже очень популярный язык программирования для back-end разработки, конечно, можно это сделать на Python, но PHP проще, вы буквально за две-три недели изучения сможете сделать свой блог, плюс на фрилансе он более востребован.</li>
		</ol>
	Также вам стоит взглянуть на рейтинг языков программирования <a href="https://pypl.github.io/PYPL.html" target="_blank">PyPl</a></h4>
	<img src="images/pypl.png">
	<center>
	    <hr>
		<h4>
			Надеюсь,вы определились с выбором языка.Но кроме языков программирования есть ещё и другие языки.К примеру данная страничка сделана на HTML(язык гипертекстовой разметки) и CSS(Каскадные таблицы стилей).Если говорить проще, то HTML-это основа сайта, а CSS-его внешний вид.Но в основном используют ещё один язык(на этот раз язык программирования) - это JavaScript.Тогда JavaScript-это работа сайта.С помощью JavaScript создают интерактивные элементы сайта.Также небольшой плюс этих трёх языков в том, что они уже есть на вашем компьютере.
		</h4>
        <iframe width="860" height="500" src="https://www.youtube.com/embed/GsmLF80xx9c" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
		<hr>
		<h1>История программирования</h1>
		<h4>Антикитерский механизм из Древней Греции был калькулятором, использовавшим шестерни различных размеров и конфигурации, обусловливавших его работу, по отслеживанию метонова цикла, до сих пор использующегося в лунно-солнечных календарях.Аль-Джазари построил программируемый автомат-гуманоид в 1206 году. Одна система, задействованная в этих устройствах, использовала зажимы и кулачки, помещённые в деревянный ящик в определённых местах, которые последовательно задействовали рычаги, которые, в свою очередь, управляли ударными инструментами.            Часто первым программируемым устройством принято считать жаккардовый ткацкий станок, построенный в 1804 году Жозефом Мари Жаккаром, который произвёл революцию в ткацкой промышленности, предоставив возможность программировать узоры на тканях при помощи перфокарт.
            
        <img src="/images/img_7.png"><br>
        
            Первое программируемое вычислительное устройство, Аналитическую машину, разработал Чарлз Бэббидж (но не смог её построить). 19 июля 1843 года графиня Ада Августа Лавлейс, дочь великого английского поэта Джорджа Байрона, как принято считать, написала первую в истории человечества программу для Аналитической машины. Эта программа решала уравнение Бернулли, выражающее закон сохранения энергии движущейся жидкости. В своей первой и единственной научной работе Ада Лавлейс рассмотрела большое число вопросов. Ряд высказанных ею общих положений (принцип экономии рабочих ячеек памяти, связь рекуррентных формул с циклическими процессами вычислений) сохранили свое принципиальное значение и для современного программирования. В материалах Бэббиджа и комментариях Лавлейс намечены такие понятия, как подпрограмма и библиотека подпрограмм, модификация команд и индексный регистр, которые стали употребляться только в 1950-х годах. Однако ни одна из программ, написанных Адой Лавлейс, никогда так и не была запущена.
        </h4>
	</center>
    <?php include 'scripts/menu.php';?>
</body>